# 2.2 Pandas - DataFrames

In [1]:
import pandas as pd
import numpy as np

#### 1. Obtenha um dataframe das seguintes séries <br>
Dados de amostra: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83 ]}<br>

In [2]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

####  2. Itere sobre as linhas do DataFrame12. <br>
dataframe12 = [{'nome':'Anastasia', 'pontuação':12.5}, {'nome':'Dima','pontuação':9}, {'nome':'Katherine','pontuação':16.5} ]<br>

In [3]:
dataframe12 = pd.DataFrame([{'nome':'Anastasia', 'pontuação':12.5}, {'nome':'Dima','pontuação':9}, {'nome':'Katherine','pontuação':16.5} ])
print(dataframe12)
for index, row in dataframe12.iterrows():
    print(row['nome'], row['pontuação'])

        nome  pontuação
0  Anastasia       12.5
1       Dima        9.0
2  Katherine       16.5
Anastasia 12.5
Dima 9.0
Katherine 16.5

#### 3. Renomeie as colunas do DataFrame3 para coluna1, coluna2 e coluna2. <br>
DataFrame3 <br>
col1 col2 col3<br>
0 1 4 7<br>
1 4 5 8<br>
2 3 6 9<br>
3 4 7 0<br>
4 5 8 1<br>

In [4]:
dataframe3 = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df3 = pd.DataFrame(data=dataframe3)
df3

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

#### 4. Selecione linhas do DataFrame3 com base nos valores de algumas colunas. <br>
Linhas para valor de colum1 == 4<br>

In [5]:
print(df3.loc[df3['col1'] == 4])

   col1  col2  col3
1     4     5     8
3     4     7     0

#### 5. Altere a ordem das colunas do DataFrame3.<br>
alterar col1 e col3<br>

In [6]:
df3 = df3[['col3', 'col2', 'col1']]
print(df3)

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

#### 6. Adicione a linha 10,11,12 ao DataFrame3. <br>

In [7]:
df2 = {'col1': 10, 'col2': 11, 'col3': 12}
df2 = pd.DataFrame(data = df2, index = [0])
df = pd.concat([df3,df2], ignore_index=True)
print(df)

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5
5    12    11    10

#### 7. Grave DataFrame3 num arquivo CSV usando separador de tabulação ';'.<br>

In [8]:
df3.to_csv('new_file.csv', sep=';', index=False)
new_df = pd.read_csv('new_file.csv')
print(new_df)

  col3;col2;col1
0          7;4;1
1          8;5;4
2          9;6;3
3          0;7;4
4          1;8;5

#### 8. Conte o número de pessoas por cidade do seguinte DataFrame. <br>

In [9]:
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
df1

        name         city
0  Anastasia   California
1       Dima  Los Angeles
2  Katherine   California
3      James   California
4      Emily   California
5    Michael  Los Angeles
6    Matthew  Los Angeles
7      Laura      Georgia
8      Kevin      Georgia
9      Jonas  Los Angeles

In [10]:
g1 = df1.groupby(["city"]).size().reset_index(name='Number of people')
print(g1)

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

#### 9. Exclua a(s) linha(s) do DataFrame3 onde a col2 é diferente de 5 <br>

In [11]:
print(df3)
dfn = df3[df3.col2 != 5]
print("Novo DataFrame")
print(dfn)

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5
Novo DataFrame
   col3  col2  col1
0     7     4     1
2     9     6     3
3     0     7     4
4     1     8     5

#### 10. Selecione uma linha do DataFrame3 pelo índice 2.

In [12]:
result = df.iloc[[2]]
print(result)

   col3  col2  col1
2     9     6     3

#### 11. Defina o valor 5 para a célula da 3ª linha da coluna col3 no DataFrame3.

In [13]:
df3.loc[2, 'col2'] = 5
print(df3)

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     5     3
3     0     7     4
4     1     8     5

#### 12. Remova a 2ª e 4ª linhas do DataFrame3.

In [14]:
df = df.drop(df.index[[1,3]])
print(df)

   col3  col2  col1
0     7     4     1
2     9     6     3
4     1     8     5
5    12    11    10

#### 13. Divida o seguinte DataFrame4 em 70% e depois em 30%.<br>
DataFrame4: crie um dataframe com duas colunas com 10 valores aleatórios na distribuição normal

In [15]:
df4 = pd.DataFrame(np.random.randn(10, 2))
print("DataFrame4:")
print(df4)
part_70 = df4.sample(frac=0.7,random_state=10)
part_30 = df4.drop(part_70.index)
print("\n70%:")
print(part_70)
print("\n30%:")
print(part_30)

DataFrame4:
          0         1
0 -1.026700 -1.158496
1 -1.079828 -0.081650
2  0.367142 -0.634753
3 -1.096593  0.186709
4  2.230456  0.496005
5  1.375854 -1.084881
6 -0.705902  1.120712
7  0.519142  0.029895
8 -0.809253  1.482071
9  1.236987 -1.772815

70%:
          0         1
8 -0.809253  1.482071
2  0.367142 -0.634753
5  1.375854 -1.084881
6 -0.705902  1.120712
3 -1.096593  0.186709
1 -1.079828 -0.081650
0 -1.026700 -1.158496

30%:
          0         1
4  2.230456  0.496005
7  0.519142  0.029895
9  1.236987 -1.772815

#### 14. Combine duas séries num DataFrame5. <br>

s1: <br>
0 100<br>
1 200<br>
2 python<br>
3 300,12<br>
4 400<br>
<br>
s2:<br>
0 10<br>
1 20<br>
2 php<br>
3 30,12<br>
4 40<br>

In [16]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])
print(s1)
print(s2)
df5 = pd.concat([s1, s2], axis=1)
print("Novo dataframe:")
print(df5)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
0       10
1       20
2      php
3    30.12
4       40
dtype: object
Novo dataframe:
        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

#### 15. Baralhe algumas linhas do DataFrame5.

In [17]:
df5 = df5.sample(frac=1)
print(df5)

        0      1
1     200     20
0     100     10
2  python    php
3  300.12  30.12
4     400     40

#### 16. Converta o tipo de coluna do DataFrame6 de string para datetime.<br>
DataFrame6<br>
03/11/2000<br>
1 3/12/2000<br>
2 3/13/2000<br>
dtype: objeto<br>

In [18]:
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
print(s)
r = pd.to_datetime(pd.Series(s))
df6 = pd.DataFrame(r)
print(df6)

0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object
           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

#### 17.  Renomeie o nome da col2 para Column2 do dataframe7. <br>
DataFrame7 <br>
col1 col2 col3<br>
0 1 4 7<br>
1 2 5 8<br>
2 3 6 9<br>

In [19]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df7 = pd.DataFrame(data=d)
print("DataFrame Original")
print(df7)
df7=df7.rename(columns = {'col2':'Coluna2'})
print("\nNovo DataFrame")
print(df7)

DataFrame Original
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

Novo DataFrame
   col1  Coluna2  col3
0     1        4     7
1     2        5     8
2     3        6     9

#### 18.  Obtenha uma lista dos elementos da Coluna2 do dataframe7 <br>

In [20]:
col2_list = df7["Coluna2"].tolist()
print(col2_list)

[4, 5, 6]

#### 19.  Encontre a linha onde o valor de cada coluna é máximo no dataframe8 <br>
dataframe8<br>
  col1 col2 col3<br>
0   1 4 7<br>
1   2 5 8<br>
2   3 6 12<br>
3   4 9 1<br>
4   7 5 11<br>

In [21]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df8 = pd.DataFrame(data=d)
print("DataFrame8")
print(df8)
print("Indice da linha onde a col1 tem o valor máximo:")
print(df8['col1'].argmax())
print("Indice da linha onde a col2 tem o valor máximo:")
print(df8['col2'].argmax())
print("Indice da linha onde a col3 tem o valor máximo:")
print(df8['col3'].argmax())

DataFrame8
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Indice da linha onde a col1 tem o valor máximo:
4
Indice da linha onde a col2 tem o valor máximo:
3
Indice da linha onde a col3 tem o valor máximo:
2

#### 20. Verifique se uma determinada coluna col1 e col4 estão presentes no dataframe8. <br>

In [22]:
if 'col4' in df8.columns:
  print("Col4 está presente no DataFrame8.")
else:
  print("Col4 não está presente no DataFrame8.")
if 'col1' in df8.columns:
  print("Col1 está presente no DataFrame8.")
else:
  print("Col1 não está presente no DataFrame8.")

Col4 não está presente no DataFrame8.
Col1 está presente no DataFrame8.

#### 21.  Anexe dados a um DataFrame vazio. <br>
Objetivo:<br>
col1 col2<br>
0 0 0<br>
1 1 1<br>
2 2 2<br>

In [23]:
df = pd.DataFrame()
data = pd.DataFrame({"col1": range(3),"col2": range(3)})
df = pd.concat([df,data])
print(df)

   col1  col2
0     0     0
1     1     1
2     2     2

#### 22.  Remova valores infinitos do DataFrame9 (devem aparecer a null)<br>
0<br>
0 1000,000000<br>
1 2000,000000<br>
2 3000,000000<br>
3 -4000,000000<br>
4 inf<br>
5 -inf<br>

In [24]:
df9 = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print("DataFrame9:")
print(df9)
print("\nDataFrame9 com infinitos a null:")
df9 = df9.replace([np.inf, -np.inf], np.nan)
print(df9)

DataFrame9:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf

DataFrame9 com infinitos a null:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

#### 23.  Insira a coluna col1 no local correto do DataFrame10 <br>
col1 = [1,2,3,4,7]<br>
DataFrame10:<br>
col2 col3<br>
0 4 7<br>
1 5 8<br>
2 6 12<br>
3 9 1<br>
4 5 11<br>

In [25]:
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df10 = pd.DataFrame(data=d)
print("DataFrame10")
print(df10)
new_col = [1, 2, 3, 4, 7]  
idx = 0
df10.insert(loc=idx, column='col1', value=new_col)
print("\nDataFrame10_novo")
print(df10)

DataFrame10
   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

DataFrame10_novo
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

#### 24.  Converta a seguinte lista de listas num Dataframe11. <br>
[[2, 4], [1, 3]]<br>

In [26]:
my_lists = [['col1', 'col2'], [2, 4], [1, 3]]
headers = my_lists.pop(0) 
df11 = pd.DataFrame(my_lists, columns = headers)
print("DataFrame11")
print(df)

DataFrame11
   col1  col2
0     0     0
1     1     1
2     2     2

#### 25.  Agrupe pela primeira coluna e obtenha a segunda coluna como listas em linhas. <br>
DataFrame12 <br>
col1 col2<br>
0 C1 1<br>
1 C1 2<br>
2 C2 3<br>
3 C2 3<br>
4 C2 4<br>
5 C3 6<br>
6 C2 5<br>

In [27]:
df12 = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
print("DataFrame12")
print(df12)
df12 = df12.groupby('col1')['col2'].apply(list)
print("\nAgrupamento na col1:")
print(df12)

DataFrame12
  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

Agrupamento na col1:
col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

#### 26.  Obtenha o índice da coluna col2 do DataFrame10. <br>

In [28]:
print(df10.columns.get_loc("col2"))

1

#### 27.  Conte o número de colunas do DataFrame10. <br>

In [29]:
print(len(df10.columns))

3

#### 28.  Selecione todas as colunas, exceto a coluna col3 do DataFrame10. <br>

In [30]:
df10 = df10.loc[:, df10.columns != 'col3']
print(df10)

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

#### 29.  Obtenha os primeiros 3 registos do DataFrame10.

In [31]:
print(df10.head(3))

   col1  col2
0     1     4
1     2     5
2     3     6

#### 30.  Obtenha os últimos 3 registos do DataFrame10.<br>

In [32]:
print(df10.tail(3))

   col1  col2
2     3     6
3     4     9
4     7     5

#### 31.  Remova os primeiras 3 registos do DataFrame13. <br>
DataFrame13
col1 col2 col3<br>
0  1 4 7<br>
1  2 5 5<br>
2  3 6 8<br>
3  4 9 12<br>
4  7 5 1<br>
5  11 0 11<br>
6  1 4 7<br>
7  4 5 8<br>
8  3 6 9<br>
9  4 7 0<br>
10  5 8 1<br>

In [33]:
d = {'col1': [1, 2, 3, 4, 7, 11,1, 4, 3, 4, 5], 'col2': [4, 5, 6, 9, 5, 0,4, 5, 6, 7, 8], 'col3': [7, 5, 8, 12, 1,11,7, 8, 9, 0, 1]}
df13 = pd.DataFrame(data=d)
df13 = df13.iloc[3:]
print(df13)

    col1  col2  col3
3      4     9    12
4      7     5     1
5     11     0    11
6      1     4     7
7      4     5     8
8      3     6     9
9      4     7     0
10     5     8     1

#### 32.  Remova os últimos 3 registos do DataFrame13.<br>

In [34]:
df13 = df13.iloc[:3]
print(df13)

   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11

#### 33.  Adicione um prefixo(A_) ou sufixo(_1) ao nome de todas as colunas do DataFrame14. <br>
W X Y Z<br>
0 68 78 84 86<br>
1 75 85 94 97<br>
2 86 96 89 96<br>
3 80 80 83 72<br>
4 66 86 86 83<br>

In [35]:
df14 = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df14 = df14.add_prefix("A_")
df14 = df14.add_suffix("_1")
print(df14)

   A_W_1  A_X_1  A_Y_1  A_Z_1
0     68     78     84     86
1     75     85     94     97
2     86     96     89     96
3     80     80     83     72
4     66     86     86     83

#### 34.  Inverta a ordem das linhas e depois das colunas do DataFrame14. <br>

In [36]:
print('inverter ordem da coluna')
print(df14.loc[:, ::-1])
print('inverter ordem da linha')
print(df14.loc[::-1])
print('inverter ordem da coluna e fazer reset ao indíce')
print(df14.loc[::-1].reset_index(drop = True))

inverter ordem da coluna
   A_Z_1  A_Y_1  A_X_1  A_W_1
0     86     84     78     68
1     97     94     85     75
2     96     89     96     86
3     72     83     80     80
4     83     86     86     66
inverter ordem da linha
   A_W_1  A_X_1  A_Y_1  A_Z_1
4     66     86     86     83
3     80     80     83     72
2     86     96     89     96
1     75     85     94     97
0     68     78     84     86
inverter ordem da coluna e fazer reset ao indíce
   A_W_1  A_X_1  A_Y_1  A_Z_1
0     66     86     86     83
1     80     80     83     72
2     86     96     89     96
3     75     85     94     97
4     68     78     84     86

#### 35.  Selecione colunas por tipo de dados do DataFrame15. <br>
DataFrame15
{<br>
    'nome': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],<br>
    'data_de_nascimento': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],<br>
    'idade': [18.5, 21.2, 22.5, 22, 23]<br>
}

In [37]:
df15 = pd.DataFrame({
    'Nome ': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Data_De_Nascimento ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Idade ': [18.5, 21.2, 22.5, 22, 23]
})

print("DataFrame15")
print(df15)
print("\nSeleção de colunas numéricas")
print(df15.select_dtypes(include = "number"))
print("\nSeleção de colunas não numéricas")
print(df15.select_dtypes(include = "object"))

DataFrame15
            Nome  Data_De_Nascimento   Idade
0  Alberto Franco          17/05/2002    18.5
1    Gino Mcneill          16/02/1999    21.2
2     Ryan Parkes          25/09/1998    22.5
3    Eesha Hinton          11/05/2002    22.0
4    Syed Wharton          15/09/1997    23.0

Seleção de colunas numéricas
   Idade
0    18.5
1    21.2
2    22.5
3    22.0
4    23.0

Seleção de colunas não numéricas
            Nome  Data_De_Nascimento
0  Alberto Franco          17/05/2002
1    Gino Mcneill          16/02/1999
2     Ryan Parkes          25/09/1998
3    Eesha Hinton          11/05/2002
4    Syed Wharton          15/09/1997

#### 36.  Renomeie todas as colunas do DataFrame15: remova o espaço em branco à direita (no final) e converta para letras minúsculas o nome das colunas.<br>

In [38]:
print("DataFrame15")
print(df15)
df15.columns = df15.columns.str.lower().str.rstrip()
#lower para colocar tudo em minusculas
#rstrip remove caracteres brancos à direita -> lstrip à espquerda
print(df15.head())

DataFrame15
            Nome  Data_De_Nascimento   Idade
0  Alberto Franco          17/05/2002    18.5
1    Gino Mcneill          16/02/1999    21.2
2     Ryan Parkes          25/09/1998    22.5
3    Eesha Hinton          11/05/2002    22.0
4    Syed Wharton          15/09/1997    23.0
             nome data_de_nascimento  idade
0  Alberto Franco         17/05/2002   18.5
1    Gino Mcneill         16/02/1999   21.2
2     Ryan Parkes         25/09/1998   22.5
3    Eesha Hinton         11/05/2002   22.0
4    Syed Wharton         15/09/1997   23.0

#### 37.  Exiba o uso de memória do DataFrame15 e de cada coluna do DataFrame15. <br>

In [39]:
print("\nUso global de memória do DataFrame15:")
print(df15.info(memory_usage = "deep"))
print("\nUso de memória de cada coluna do DataFrame15:")
print(df15.memory_usage(deep = True))

Uso global de memória do DataFrame15:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   nome                5 non-null      object
 1   data_de_nascimento  5 non-null      object
 2   idade               5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 849.0 bytes
None

Uso de memória de cada coluna do DataFrame15:
Index                 128
nome                  346
data_de_nascimento    335
idade                  40
dtype: int64

#### 38.  Combine várias séries para criar um DataFrame. <br>
Sr1:<br>
0 php<br>
1 python<br>
2 java<br>
3c#<br>
4c++<br>
<br>
Sr2:<br>
0 1<br>
1 2<br>
2 3<br>
3 4<br>
4 5<br>

In [40]:
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])
print("Séries originais:")
print(sr1)
print(sr2)
print("Combinar as duas séries num DataFrame:")
ser_df = pd.DataFrame(sr1, sr2).reset_index()
print(ser_df.head())
print("\nRecorrendo ao concat:")
ser_df = pd.concat([sr1, sr2], axis = 1)
print(ser_df.head())
print("\nRecorrerndo ao DataFrame usando um dicionário, dá um nome específico às colunas:")
ser_df = pd.DataFrame({"col1":sr1, "col2":sr2})
print(ser_df.head(5))

Séries originais:
0       php
1    python
2      java
3        c#
4       c++
dtype: object
0    1
1    2
2    3
3    4
4    5
dtype: int64
Combinar as duas séries num DataFrame:
   index       0
0      1  python
1      2    java
2      3      c#
3      4     c++
4      5     NaN

Recorrendo ao concat:
        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5

Recorrerndo ao DataFrame usando um dicionário, dá um nome específico às colunas:
     col1  col2
0     php     1
1  python     2
2    java     3
3      c#     4
4     c++     5